In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({
    "id": [1, 2, 3],
    "name": ["Adam", "Bob", "Charlie"]
})

In [3]:
df2 = pd.DataFrame({
    "id": [4, 5, 6],
    "name": ["David", "Eva", "Frank"]
})

In [4]:
pd.concat([df1, df2])       # Row wise concatenation

   id     name
0   1     Adam
1   2      Bob
2   3  Charlie
0   4    David
1   5      Eva
2   6    Frank

In [5]:
pd.concat([df1, df2], axis=1)    # Col wise concatenation

   id     name  id   name
0   1     Adam   4  David
1   2      Bob   5    Eva
2   3  Charlie   6  Frank

In [6]:
pd.concat([df1, df2], ignore_index=True)    # Row wise concatenation - new index

   id     name
0   1     Adam
1   2      Bob
2   3  Charlie
3   4    David
4   5      Eva
5   6    Frank